Джира/src/InformationRegisters/Центр_ПросроченныеДействияПоЗадачам/Центр_ПросроченныеДействияПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Центр_ПросроченныеДействияПоЗадачам</name>
  <comment>Просроченные действия по задачам</comment>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Центр_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.Центр_КонтрольНадЭтапамиЗадач</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Джира/src/Catalogs/Центр_КонтрольНадЭтапамиЗадач/Центр_КонтрольНадЭтапамиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Центр_КонтрольНадЭтапамиЗадач</name>
  <comment>Контроль над этапами задач</comment>
  <attributes>
    <name>Запрос</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Джира/src/CommonModules/Центр_ОбработкаПроверкиВыполненияЭтаповКонтроля/Module.bsl
#Область  ПрограммныйИнтерфейс
Процедура Центр_ПроверкаВыполненияЭтаповКонтроля() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Центр_КонтрольНадЭтапамиЗадач.Запрос КАК Запрос,
		|	Центр_КонтрольНадЭтапамиЗадач.Ссылка КАК Ссылка,
		|	Центр_КонтрольНадЭтапамиЗадачПараметры.Параметр,
		|	Центр_КонтрольНадЭтапамиЗадачПараметры.Значение
		|ИЗ
		|	Справочник.Центр_КонтрольНадЭтапамиЗадач КАК Центр_КонтрольНадЭтапамиЗадач
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Центр_КонтрольНадЭтапамиЗадач.Параметры КАК Центр_КонтрольНадЭтапамиЗадачПараметры
		|		ПО Центр_КонтрольНадЭтапамиЗадач.Ссылка = Центр_КонтрольНадЭтапамиЗадачПараметры.Ссылка
		|ИТОГИ
		|	МАКСИМУМ(Запрос)
		|ПО
		|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОчиститьРегистрСведенийКонтроля();
	Пока Выборка.Следующий() Цикл
		Попытка
			 ВыполнениеЗапросаИзСправочника(Выборка);		
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Ошибка Выполнения");
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ОчиститьРегистрСведенийКонтроля()
	Набор = РегистрыСведений.Центр_ПросроченныеДействияПоЗадачам.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Набор.Очистить();
	Набор.Записать();
КонецПроцедуры

Процедура ВыполнениеЗапросаИзСправочника(СправочникКонтроля)
	Запрос = Новый Запрос;
	Запрос.Текст = СправочникКонтроля.Запрос;
	ВыборкаПараметровКонтроля = СправочникКонтроля.Выбрать();
	Пока ВыборкаПараметровКонтроля.Следующий() Цикл
		Запрос.УстановитьПараметр(ВыборкаПараметровКонтроля.Параметр, ВыборкаПараметровКонтроля.Значение);
	КонецЦикла;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.Центр_ПросроченныеДействияПоЗадачам.СоздатьМенеджерЗаписи();
		Запись.Задача = Выборка.Ссылка;
		Запись.Пользователь = Выборка.Пользователь;
		Запись.Этап = СправочникКонтроля.Ссылка;
		Запись.Записать();
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
